MusaMahmood/nRF52_ADS1292_2CH_ECG/main.c
/**
 * Copyright (c) 2014 - 2017, Nordic Semiconductor ASA
 * 
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 * 
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 * 
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 * 
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 * 
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 * 
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 * 
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 */
/** @file
 *
 * @defgroup ble_sdk_app_template_main main.c
 * @{
 * @ingroup ble_sdk_app_template
 * @brief Template project main file.
 *
 * This file contains a template for creating a new application. It has the code necessary to wakeup
 * from button, advertise, get a connection restart advertising on disconnect and if no new
 * connection created go back to system-off mode.
 * It can easily be used as a starting point for creating a new application, the comments identified
 * with 'YOUR_JOB' indicates where and how you can customize.
 */

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "app_error.h"
#if defined(APP_TIMER_SAMPLING)
#include "app_timer.h"
#endif
#include "ble.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "ble_conn_state.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "boards.h"
#include "fds.h"
#include "fstorage.h"
#include "nordic_common.h"
#include "nrf.h"
#include "nrf_ble_gatt.h"
#include "nrf_gpio.h"
#include "sensorsim.h"
#include "softdevice_handler.h"
#define NRF_LOG_MODULE_NAME "APP"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"

#if defined(ADS1292)
#include "ads1291-2.h"
#include "ble_dis.h"
#include "ble_eeg.h"
#include "nrf_delay.h"
#include "nrf_drv_gpiote.h"
#include "uicr_config.h"
#define DEVICE_MODEL_NUMBERSTR "Version 3.1"
#define DEVICE_FIRMWARE_STRING "Version 13.1.0"
ble_eeg_t m_eeg;
static bool m_connected = false;
#define SPI_SCLK_WRITE_REG 2
#define SPI_SCLK_SAMPLING 8
#endif

#if defined(MPU9250) || defined(MPU9255) //mpu_send_timeout_handler
#include "ble_mpu.h"
ble_mpu_t m_mpu;
#include "app_mpu.h"
#include "nrf_drv_twi.h"
APP_TIMER_DEF(m_mpu_send_timer_id);
#define TICKS_MPU_SAMPLING_INTERVAL APP_TIMER_TICKS(32)
#endif
#if defined(SAADC_ENABLED) && SAADC_ENABLED == 1
#include "nrf_drv_saadc.h"
#define SAMPLES_IN_BUFFER 4
//volatile uint8_t state = 1;
#define SAADC_BURST_MODE 1 //Set to 1 to enable BURST mode, otherwise set to 0.

//static const nrf_drv_timer_t m_timer = NRF_DRV_TIMER_INSTANCE(0);
//static nrf_saadc_value_t m_buffer_pool[2][SAMPLES_IN_BUFFER];
static nrf_saadc_value_t m_buffer_pool[SAMPLES_IN_BUFFER];
//static nrf_ppi_channel_t     m_ppi_channel;
static uint32_t m_adc_evt_counter;
#endif

#if defined(BLE_BAS_ENABLED) && BLE_BAS_ENABLED == 1
#include "ble_bas.h"
#define BATTERY_LEVEL_MEAS_INTERVAL APP_TIMER_TICKS(2000) /**< Battery level measurement interval (ticks). */
APP_TIMER_DEF(m_battery_timer_id);                        /**< Battery timer. */
static ble_bas_t m_bas;                                   /**< Structure used to identify the battery service. */
#endif

#if defined(APP_TIMER_SAMPLING) && APP_TIMER_SAMPLING == 1
#define TICKS_SAMPLING_INTERVAL APP_TIMER_TICKS(1000)
APP_TIMER_DEF(m_sampling_timer_id);
static uint16_t m_samples;
#endif
#define APP_FEATURE_NOT_SUPPORTED BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2 /**< Reply when unsupported features are requested. */

#define DEVICE_NAME "nRF52-2CH-ECG"           //"nRF52_EEG"         /**< Name of device. Will be included in the advertising data. */
#define DEVICE_NAME_500 "nRF52-2CH-ECG-500Hz" //"nRF52_EEG"         /**< Name of device. Will be included in the advertising data. */
#define DEVICE_NAME_1k "nRF52-2CH-ECG-1kHz"   //"nRF52_EEG"         /**< Name of device. Will be included in the advertising data. */
#define DEVICE_NAME_2k "nRF52-2CH-ECG-2kHz"   //"nRF52_EEG"         /**< Name of device. Will be included in the advertising data. */
#define DEVICE_NAME_4k "nRF52-2CH-ECG-4kHz"   //"nRF52_EEG"         /**< Name of device. Will be included in the advertising data. */
#define DEVICE_NAME_8k "nRF52-2CH-ECG-8kHz"   //"nRF52_EEG"         /**< Name of device. Will be included in the advertising data. */

#define MANUFACTURER_NAME "Potato Labs" /**< Manufacturer. Will be passed to Device Information Service. */
#define APP_ADV_INTERVAL 300            /**< The advertising interval (in units of 0.625 ms. This value corresponds to 187.5 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS 180  /**< The advertising timeout in units of seconds. */

#define MIN_CONN_INTERVAL MSEC_TO_UNITS(16, UNIT_1_25_MS) /**< Minimum acceptable connection interval (0.1 seconds). */
#define MAX_CONN_INTERVAL MSEC_TO_UNITS(20, UNIT_1_25_MS) /**< Maximum acceptable connection interval (0.2 second). */
#define SLAVE_LATENCY 0                                   /**< Slave latency. */
#define CONN_SUP_TIMEOUT MSEC_TO_UNITS(4000, UNIT_10_MS)  /**< Connection supervisory timeout (4 seconds). */

