MusaMahmood/nRF52_ADS1292_2CH_ECG/main.c
  NRF_LOG_INFO("Starting advertising.\r\n");

  ret_code_t err_code = sd_ble_gap_adv_start(&adv_params, CONN_CFG_TAG);
  APP_ERROR_CHECK(err_code);
}

#if (defined(MPU60x0) || defined(MPU9150) || defined(MPU9250) || defined(MPU9255))
///*
//MPU9250;MPU9255
void mpu_setup(void) {
  ret_code_t ret_code;
  // Initiate MPU driver
  ret_code = mpu_init();
  APP_ERROR_CHECK(ret_code); // Check for errors in return value

  // Setup and configure the MPU with intial values
  mpu_config_t p_mpu_config = MPU_DEFAULT_CONFIG(); // Load default values
  p_mpu_config.smplrt_div = 19;                     // Change sampelrate. Sample Rate = Gyroscope Output Rate / (1 + SMPLRT_DIV). 19 gives a sample rate of 50Hz
  p_mpu_config.accel_config.afs_sel = AFS_16G;      // Set accelerometer full scale range to 2G
  ret_code = mpu_config(&p_mpu_config);             // Configure the MPU with above values
  APP_ERROR_CHECK(ret_code);                        // Check for errors in return value
}
//*/
#endif

#if defined(SAADC_ENABLED) && SAADC_ENABLED == 1

void saadc_callback(nrf_drv_saadc_evt_t const *p_event) {
  if (p_event->type == NRF_DRV_SAADC_EVT_DONE) {
    ret_code_t err_code;
    uint8_t battery_level = 0;
    err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);

    int i;
    NRF_LOG_INFO("ADC event number: %d\r\n", (int)m_adc_evt_counter);

    for (i = 0; i < SAMPLES_IN_BUFFER; i++) {
      NRF_LOG_INFO("%d\r\n", p_event->data.done.p_buffer[i]);
    }
    m_bas.battery_level = p_event->data.done.p_buffer[3];
    err_code = ble_bas_battery_level_update(&m_bas);
    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)) {
      APP_ERROR_HANDLER(err_code);
    }
    m_adc_evt_counter++;
    nrf_gpio_pin_set(BATTERY_LOAD_SWITCH_CTRL_PIN); //LOAD SWITCH OFF
  }
}

void saadc_init(void) {

  ret_code_t err_code;
  nrf_drv_saadc_config_t saadc_config;
  //Configure SAADC
  saadc_config.low_power_mode = true;                     //Enable low power mode.
  saadc_config.resolution = NRF_SAADC_RESOLUTION_12BIT;   //Set SAADC resolution to 12-bit. This will make the SAADC output values from 0 (when input voltage is 0V) to 2^12=2048 (when input voltage is 3.6V for channel gain setting of 1/6).
  saadc_config.oversample = NRF_SAADC_OVERSAMPLE_4X;      //Set oversample to 4x. This will make the SAADC output a single averaged value when the SAMPLE task is triggered 4 times.
  saadc_config.interrupt_priority = APP_IRQ_PRIORITY_LOW; //Set SAADC interrupt to low priority.

  nrf_saadc_channel_config_t channel_config =
      NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN3);

  err_code = nrf_drv_saadc_init(&saadc_config, saadc_callback);
  APP_ERROR_CHECK(err_code);

  err_code = nrf_drv_saadc_channel_init(0, &channel_config);
  APP_ERROR_CHECK(err_code);

  if (SAADC_BURST_MODE) {
    NRF_SAADC->CH[0].CONFIG |= 0x01000000; //Configure burst mode for channel 0. Burst is useful together with oversampling. When triggering the SAMPLE task in burst mode, the SAADC will sample "Oversample" number of times as fast as it can and then output a single averaged value to the RAM buffer. If burst mode is not enabled, the SAMPLE task needs to be triggered "Oversample" number of times to output a single averaged value to the RAM buffer.
  }

  err_code = nrf_drv_saadc_buffer_convert(&m_buffer_pool[0], SAMPLES_IN_BUFFER);
  APP_ERROR_CHECK(err_code);

  //  err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[1], SAMPLES_IN_BUFFER);
  //  APP_ERROR_CHECK(err_code);
}
#endif

void in_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action) {
  UNUSED_PARAMETER(pin);
  UNUSED_PARAMETER(action);
  if (m_connected) {
    get_eeg_voltage_array_2ch(&m_eeg);
  }
#if defined(APP_TIMER_SAMPLING) && APP_TIMER_SAMPLING == 1
  m_samples += 1;
#endif
  if (m_eeg.eeg_ch1_count == EEG_PACKET_LENGTH) {
    m_eeg.eeg_ch1_count = 0;
    ble_eeg_update_2ch(&m_eeg);
  }
}

static void ads1299_gpio_init(void) {
#if defined(BOARD_NRF_BREAKOUT) | defined(BOARD_PCA10028) | defined(BOARD_PCA10040) | defined(BOARD_2CH_ECG_RAT)
  nrf_gpio_pin_dir_set(ADS1291_2_DRDY_PIN, NRF_GPIO_PIN_DIR_INPUT); //sets 'direction' = input/output
  nrf_gpio_pin_dir_set(ADS1291_2_PWDN_PIN, NRF_GPIO_PIN_DIR_OUTPUT);
#endif
#if defined(BOARD_2CH_ECG_RAT) && LEDS_ENABLE == 1
  nrf_gpio_cfg_output(LED_1);
  nrf_gpio_cfg_output(LED_2);
  nrf_gpio_pin_set(LED_1);
  nrf_gpio_pin_set(LED_2);
#endif
#ifdef BATTERY_LOAD_SWITCH_CTRL_PIN
  nrf_gpio_cfg_output(BATTERY_LOAD_SWITCH_CTRL_PIN);
  nrf_gpio_pin_set(BATTERY_LOAD_SWITCH_CTRL_PIN); //OFF
#endif
  uint32_t err_code;
  if (!nrf_drv_gpiote_is_init()) {
    err_code = nrf_drv_gpiote_init();
  }
  NRF_LOG_RAW_INFO(" nrf_drv_gpiote_init: %d\r\n", err_code);
  NRF_LOG_FLUSH();
  APP_ERROR_CHECK(err_code);
  bool is_high_accuracy = true;
  nrf_drv_gpiote_in_config_t in_config = GPIOTE_CONFIG_IN_SENSE_HITOLO(is_high_accuracy);
  in_config.is_watcher = true;
  in_config.pull = NRF_GPIO_PIN_NOPULL;
  err_code = nrf_drv_gpiote_in_init(ADS1291_2_DRDY_PIN, &in_config, in_pin_handler);
  NRF_LOG_RAW_INFO(" nrf_drv_gpiote_in_init: %d: \r\n", err_code);
  NRF_LOG_FLUSH();
  APP_ERROR_CHECK(err_code);
  nrf_drv_gpiote_in_event_enable(ADS1291_2_DRDY_PIN, true);
  ads1291_2_powerdn();
}

static void wait_for_event(void) {
  (void)sd_app_evt_wait();
}
/**@brief Function for application main entry.
 */
int main(void) {
  bool erase_bonds = false;
  uint32_t err_code = NRF_SUCCESS;
  // Initialize.
  log_init();
  timers_init();
  ble_stack_init();
  ads1299_gpio_init();
  gap_params_init();
  gatt_init();
  advertising_init();
  services_init();
  conn_params_init();
#if defined(ADS1292)
  //SPI STUFF FOR ADS:

  ads_spi_init_with_sample_freq(SPI_SCLK_WRITE_REG);
  nrf_delay_ms(5);
  // Stop continuous data conversion and initialize registers to default values
  ads1291_2_powerdn();
  ads1291_2_powerup();
  ads1291_2_stop_rdatac();

  ads1291_2_init_regs();

  ads1291_2_soft_start_conversion();
  ads1291_2_check_id();
  ads1291_2_start_rdatac();

  // Put AFE to sleep while we're not connected
  ads1291_2_standby();
  body_voltage_t body_voltage;
  nrf_delay_ms(10);
  m_eeg.eeg_ch1_count = 0;
#endif
#if defined(SAADC_ENABLED) && SAADC_ENABLED == 1
  saadc_init();
#endif
#if (defined(MPU60x0) || defined(MPU9150) || defined(MPU9250) || defined(MPU9255))
  mpu_setup();
#endif
  // Start execution.
  application_timers_start();
  advertising_start();
  NRF_LOG_RAW_INFO(" BLE Advertising Start! \r\n");
  NRF_LOG_FLUSH();
#if LEDS_ENABLE == 1
  nrf_gpio_pin_clear(LED_2); // Green
  nrf_gpio_pin_set(LED_1);   //Blue
#endif
#if defined(APP_TIMER_SAMPLING) && APP_TIMER_SAMPLING == 1
  m_samples = 0;
#endif
// Enter main loop
#if NRF_LOG_ENABLED == 1
  //  for (;;) {
  //    if (!NRF_LOG_PROCESS()) {
  //      wait_for_event();
  //    }
  //  }
  while (1) {
    NRF_LOG_FLUSH();
  }
#endif
}

/**
 * @}
 */